Tekla Open API Reference for Tekla Structures 2025
Operation.CreateMISFileFromAll Method
 Creates MIS files from all parts using the given file name.
See Tekla Structures Help for more information about MIS files.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool CreateMISFileFromAll(
	Operation.MISExportTypeEnum MISType,
	string FileName
)
Public Shared Function CreateMISFileFromAll (
	MISType As Operation.MISExportTypeEnum,
	FileName As String
) As Boolean
Parameters
MISType
Type: Tekla.Structures.Model.Operations.Operation.MISExportTypeEnum
The type of the MIS export.
FileName
Type: System.String
The name of the MIS file to be used in creation.
Return Value
Type: Boolean
True if the MIS files are created, false if the numbering is not up-to-date or the used configuration is wrong.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the FileName is null.
ArgumentException | Thrown when the FileName is not defined.
Examples
using Tekla.Structures.Model.Operations;
using System.Windows.Forms;
public class Example
{
       public void Example1()
       {
           if (Operation.CreateMISFileFromAll(Operation.MISExportTypeEnum.STEEL2000, "myExport.st2000"))
               MessageBox.Show("MIS creation successful");
       }
}
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace